/*
 * @Description:
 * @Version: 1.0.0
 * @Author: lax
 * @Date: 2022-03-05 15:16:30
 * @LastEditors: lax
 * @LastEditTime: 2022-03-05 15:30:09
 * @FilePath: \taobi\test\star.js
 */
module.exports = {
	list1: ["蓬", "任", "冲", "辅", "英", "芮", "柱", "心"],
	list2: ["心", "蓬", "任", "冲", "辅", "英", "芮", "柱"],
	list3: ["柱", "心", "蓬", "任", "冲", "辅", "英", "芮"],
	list4: ["芮", "柱", "心", "蓬", "任", "冲", "辅", "英"],
	list5: ["英", "芮", "柱", "心", "蓬", "任", "冲", "辅"],
	list6: ["辅", "英", "芮", "柱", "心", "蓬", "任", "冲"],
	list7: ["冲", "辅", "英", "芮", "柱", "心", "蓬", "任"],
	list8: ["任", "冲", "辅", "英", "芮", "柱", "心", "蓬"],
};
