/*
 * @Description:
 * @Version: 1.0.0
 * @Author: lax
 * @Date: 2022-02-27 16:48:41
 * @LastEditors: lax
 * @LastEditTime: 2022-02-27 17:48:46
 * @FilePath: \taobi\test\surpriseCeremony.js
 */
module.exports = {
	list1: ["戊", "己", "庚", "辛", "壬", "癸", "丁", "丙", "乙"],
	list2: ["乙", "戊", "己", "庚", "辛", "壬", "癸", "丁", "丙"],
	list3: ["丙", "乙", "戊", "己", "庚", "辛", "壬", "癸", "丁"],
	list4: ["丁", "丙", "乙", "戊", "己", "庚", "辛", "壬", "癸"],
	list5: ["癸", "丁", "丙", "乙", "戊", "己", "庚", "辛", "壬"],
	list6: ["壬", "癸", "丁", "丙", "乙", "戊", "己", "庚", "辛"],
	list7: ["辛", "壬", "癸", "丁", "丙", "乙", "戊", "己", "庚"],
	list8: ["庚", "辛", "壬", "癸", "丁", "丙", "乙", "戊", "己"],
	list9: ["己", "庚", "辛", "壬", "癸", "丁", "丙", "乙", "戊"],
	_list1: ["戊", "乙", "丙", "丁", "癸", "壬", "辛", "庚", "己"],
	_list2: ["己", "戊", "乙", "丙", "丁", "癸", "壬", "辛", "庚"],
	_list3: ["庚", "己", "戊", "乙", "丙", "丁", "癸", "壬", "辛"],
	_list4: ["辛", "庚", "己", "戊", "乙", "丙", "丁", "癸", "壬"],
	_list5: ["壬", "辛", "庚", "己", "戊", "乙", "丙", "丁", "癸"],
	_list6: ["癸", "壬", "辛", "庚", "己", "戊", "乙", "丙", "丁"],
	_list7: ["丁", "癸", "壬", "辛", "庚", "己", "戊", "乙", "丙"],
	_list8: ["丙", "丁", "癸", "壬", "辛", "庚", "己", "戊", "乙"],
	_list9: ["乙", "丙", "丁", "癸", "壬", "辛", "庚", "己", "戊"],
};
