/*
 * @Description:
 * @Version: 1.0.0
 * @Author: lax
 * @Date: 2020-10-28 19:51:37
 * @LastEditors: lax
 * @LastEditTime: 2020-12-03 20:58:18
 */
module.exports = {
	/**
	 * 天干：
	 * 十天干，按标准顺序排列。
	 */
	heavenlyStems: ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"],

	/**
	 * 地支：
	 * 十二地支，按标准顺序排列。
	 */
	terrestrialBranch: [
		"子",
		"丑",
		"寅",
		"卯",
		"辰",
		"巳",
		"午",
		"未",
		"申",
		"酉",
		"戌",
		"亥"
	],

	/**
	 * 六仪：
	 * 为十天干中的戌、己、庚、辛、壬、癸。
	 * 对应为六只仪仗队，六甲将分别隐喻六仪之中
	 */
	ceremony: ["戊", "己", "庚", "辛", "壬", "癸"],

	/**
	 * 三奇：
	 * 为十天干中的乙、丙、丁。
	 * 对应三奇，分别为日奇，掌文、月奇，善武，星奇，粮草。
	 */
	surprise: ["丁", "丙", "乙"],

	/**
	 * 天盘：
	 */
	star: [
		"天蓬星",
		"天芮星",
		"天冲星",
		"天辅星",
		"天禽星",
		"天心星",
		"天柱星",
		"天任星",
		"天英星"
	],

	/**
	 * 星序：
	 * 根据后天八卦的排序而得
	 */
	starOrder: [
		"天蓬星",
		"天任星",
		"天冲星",
		"天辅星",
		"天英星",
		"天芮星",
		"天柱星",
		"天心星"
	]
};
