/*
 * @Description:
 * @Version: 1.0.0
 * @Author: lax
 * @Date: 2020-10-28 19:51:37
 * @LastEditors: lax
 * @LastEditTime: 2022-02-27 23:55:52
 */
module.exports = {
	/**
	 * 天干：
	 * 十天干，按标准顺序排列。
	 */
	celestialStems: ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"],

	/**
	 * 地支：
	 * 十二地支，按标准顺序排列。
	 */
	terrestrialBranches: [
		"子",
		"丑",
		"寅",
		"卯",
		"辰",
		"巳",
		"午",
		"未",
		"申",
		"酉",
		"戌",
		"亥",
	],

	/**
	 * 六十天干地支
	 */
	sexagenaryCycle: [
		"甲子",
		"乙丑",
		"丙寅",
		"丁卯",
		"戊辰",
		"己巳",
		"庚午",
		"辛未",
		"壬申",
		"癸酉",
		"甲戌",
		"乙亥",
		"丙子",
		"丁丑",
		"戊寅",
		"己卯",
		"庚辰",
		"辛巳",
		"壬午",
		"癸未",
		"甲申",
		"乙酉",
		"丙戌",
		"丁亥",
		"戊子",
		"己丑",
		"庚寅",
		"辛卯",
		"壬辰",
		"癸巳",
		"甲午",
		"乙未",
		"丙申",
		"丁酉",
		"戊戌",
		"己亥",
		"庚子",
		"辛丑",
		"壬寅",
		"癸卯",
		"甲辰",
		"乙巳",
		"丙午",
		"丁未",
		"戊申",
		"己酉",
		"庚戌",
		"辛亥",
		"壬子",
		"癸丑",
		"甲寅",
		"乙卯",
		"丙辰",
		"丁巳",
		"戊午",
		"己未",
		"庚申",
		"辛酉",
		"壬戌",
		"癸亥",
	],

	/**
	 * 六仪：
	 * 为十天干中的戌、己、庚、辛、壬、癸。
	 * 对应为六只仪仗队，六甲将分别隐喻六仪之中
	 */
	ceremony: ["戊", "己", "庚", "辛", "壬", "癸"],

	/**
	 * 三奇：
	 * 为十天干中的乙、丙、丁。
	 * 对应三奇，分别为日奇，掌文、月奇，善武，星奇，粮草。
	 */
	surprise: ["丁", "丙", "乙"],

	/**
	 * 后天八卦：
	 */
	acquired: ["坎", "坤", "震", "巽", "中", "乾", "兑", "艮", "离"],

	/**
	 * 九星：
	 */
	star: [
		"天蓬星",
		"天芮星",
		"天冲星",
		"天辅星",
		"天禽星",
		"天心星",
		"天柱星",
		"天任星",
		"天英星",
	],

	/**
	 * 八门：
	 */
	people: ["休门", "死门", "伤门", "杜门", "", "开门", "惊门", "生门", "景门"],
};
