/*
 * @Description:
 * @Version: 1.0.0
 * @Author: lax
 * @Date: 2022-03-05 15:16:30
 * @LastEditors: lax
 * @LastEditTime: 2022-09-10 10:45:07
 * @FilePath: \taobi\test\star.js
 */
module.exports = [
	["休", "生", "伤", "杜", "景", "死", "惊", "开"],
	["死", "惊", "开", "休", "生", "伤", "杜", "景"],
	["伤", "杜", "景", "死", "惊", "开", "休", "生"],
	["杜", "景", "死", "惊", "开", "休", "生", "伤"],
	[],
	["开", "休", "生", "伤", "杜", "景", "死", "惊"],
	["惊", "开", "休", "生", "伤", "杜", "景", "死"],
	["生", "伤", "杜", "景", "死", "惊", "开", "休"],
	["景", "死", "惊", "开", "休", "生", "伤", "杜"],
];
