/*
 * @Description:
 * @Version: 1.0.0
 * @Author: lax
 * @Date: 2022-03-05 15:16:30
 * @LastEditors: lax
 * @LastEditTime: 2022-09-06 00:16:23
 * @FilePath: \taobi\test\star.js
 */
module.exports = [
	["蓬", "任", "冲", "辅", "英", "芮", "柱", "心"],
	["芮", "柱", "心", "蓬", "任", "冲", "辅", "英"],
	["冲", "辅", "英", "芮", "柱", "心", "蓬", "任"],
	["辅", "英", "芮", "柱", "心", "蓬", "任", "冲"],
	[],
	["心", "蓬", "任", "冲", "辅", "英", "芮", "柱"],
	["柱", "心", "蓬", "任", "冲", "辅", "英", "芮"],
	["任", "冲", "辅", "英", "芮", "柱", "心", "蓬"],
	["英", "芮", "柱", "心", "蓬", "任", "冲", "辅"],
];
